src/cf/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.РезервированиеТовара</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРезервирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыДляСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаТовары</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ТоварыДляСписанияКоличествоПриИзмененииНаСервере(ТоварДляПоиска, КоличествоДляРезерва,СкладДляСписания)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТоваровОстатки.Товар КАК Товар,
	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК НаСкладе,
	|	ОстаткиТоваровОстатки.ЗарезервированоОстаток КАК Зарезервировано
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
	|ГДЕ
	|	ОстаткиТоваровОстатки.Товар.Ссылка = &Товар
	|	И ОстаткиТоваровОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Товар",ТоварДляПоиска);
	Запрос.УстановитьПараметр("Склад",СкладДляСписания);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	ВсегоТовараНаСкладе = ТаблицаИзЗапроса.Итог("НаСкладе");
	ВсегоТовараЗарезервировано = ТаблицаИзЗапроса.Итог("Зарезервировано");
	СвободныйТовар = ВсегоТовараНаСкладе-ВсегоТовараЗарезервировано;
	
	Если СвободныйТовар <КоличествоДляРезерва Тогда
		Сообщить("Недостатовно товара для списавния, свободного товара на складе осталось " + СвободныйТовар);
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ТоварыДляСписанияКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТоварыДляСписания.ТекущиеДанные;
	ТоварДляПоиска = СтрокаТабличнойЧасти.НаименованиеТовара;
	КоличествоДляРезерва = СтрокаТабличнойЧасти.Количество;
	СкладДляСписания = Объект.Склад;
	ХватаетТовара = ТоварыДляСписанияКоличествоПриИзмененииНаСервере(ТоварДляПоиска, КоличествоДляРезерва,СкладДляСписания);
	Если Не ХватаетТовара Тогда
		СтрокаТабличнойЧасти.Количество = 0;
		СтрокаТабличнойЧасти.Сумма = 0;
	Иначе
		РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
		Объект.Сумма = Объект.Сумма + СтрокаТабличнойЧасти.Сумма;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТоварыДляСписанияПриИзмененииНаСервере(ТоварДляПоискаЦены)
	Запрос = Новый Запрос;
	Запрос.текст = 
	"ВЫБРАТЬ
	|	ЦеныНаТоварыСрезПоследних.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ЦеныНаТоварыСрезПоследних.Период КАК Период,
	|	ЦеныНаТоварыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНаТовары.СрезПоследних КАК ЦеныНаТоварыСрезПоследних
	|ГДЕ
	|	ЦеныНаТоварыСрезПоследних.Номенклатура.Ссылка = &Товар
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНаТоварыСрезПоследних.Номенклатура.Ссылка,
	|	ЦеныНаТоварыСрезПоследних.Период,
	|	ЦеныНаТоварыСрезПоследних.Цена";
	Запрос.УстановитьПараметр("Товар",ТоварДляПоискаЦены);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	Цена = ТаблицаИзЗапроса.Итог("Цена");
	Возврат Цена;
КонецФункции

&НаКлиенте
Процедура ТоварыДляСписанияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТоварыДляСписания.ТекущиеДанные;
	ТоварДляПоискаЦены = СтрокаТабличнойЧасти.НаименованиеТовара;
	Цена = ТоварыДляСписанияПриИзмененииНаСервере(ТоварДляПоискаЦены);
	СтрокаТабличнойЧасти.Цена = Цена;
КонецПроцедуры
